[
    { "id": 1, "title" : "What is EIP-1271?", "content" : "It is a standard way to verify a signature when an account is a smart contract."},
    { "id": 8, "title": "What is EIP-6492?", "content": "It is an extension to EIP-1271 that:<br/> 1) allows signature verification for counterfactually deployed smart accounts<br/> 2) contains an easy, unified signature verification mechanism that works across all signature types, making EIP-1271 implementation much easier."},
    { "id": 2, "title": "How to implement EIP-1271?", "content": "Check out our module documentation <a class='underline whitespace-nowrap cursor-pointer' onClick='window.open(`https://github.com/etherspot/eip1271-verification-util`)'> eip1271-verification-util</a> or find all the details in the section  <a class='underline whitespace-nowrap cursor-pointer' onClick='window.open(`https://eips.ethereum.org/EIPS/eip-1271#reference-implementation`)'>“Reference Implementation”</a>"},
    { "id": 3, "title": "Why is EIP-1271 important for the future of Ethereum?", "content": "Smart contracts cannot directly sign messages, so EIP-1271 serves as a guide to implement isValidSignature(hash, signature) on the signing contract that can be called to validate a signature. </br> With the rise of smart contract wallets and DAOs controlled by multi-sigs these parties require the means to use signed messages to demonstrate the right to move assets, vote, or for other purposes. EIP-1271 is, additionally, the foundation for account abstraction which enables the evolution of the Ethereum ecosystem."},
    { "id": 4, "title": "What kind of dApps is EIP-1271 important for?", "content": "Any dApp which would like to implement AA features that simplify UX and boost its capabilities should implement EIP-1271 but that’s not all. </br> Read Vitalik’s tweet at the top of this page to understand why EIP-1271 is vital to stay on the forefront of Ethereum development."},
    { "id": 5, "title" : "What does the account abstraction mean?", "content" : "In the context of OOP, an abstraction is a generalization of data and behavior for a type that is above the current class in the hierarchy. The approach of account abstraction in crypto means it turns accounts into smart contracts with their own logic to determine what is a valid transaction. <br> The only requirement is that they conform to a specific interface with methods for validating and executing transactions."},
    { "id": 6, "title" : "How does EIP-1271 help with AA?", "content" : "EIP-1271 is a proposed standard that allows dApps to sign messages using smart contract wallets such as (Pillar, Safe, Ambire, Argent, Sequence, Stackup, Candide etc.)  It defines a new type of address - the account abstraction address (smart contract wallet) - that is different from a regular Ethereum address and separates the account logic from the underlying account data. "},
    { "id": 7, "title" : "Who are the authors of EIP-1271?", "content" : "Authors: Francisco Giordano (@frangio), Matt Condon (@shrugs), Philippe Castonguay (@PhABC), Amir Bandeali (@abandeali1), Jorge Izquierdo (@izqui), Bertrand Masius (@catageek)."}
]